Files/XMLRequest.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:tem="http://tempuri.org/">
   <soap:Header/>
   <soap:Body>
      <tem:GetConversionRate>
         <!--Optional:-->
         <tem:CurrencyFrom>USD</tem:CurrencyFrom>
         <!--Optional:-->
         <tem:CurrencyTo>INR</tem:CurrencyTo>
         <tem:RateDate>2019-09-14T00:00:00</tem:RateDate>
      </tem:GetConversionRate>
   </soap:Body>
</soap:Envelope>